000100190131      /if not defined(COPYRIGHT_DSPEC)
000101190131     h copyright('V1.0.1 - 31.01.2019 - mailto: thomas.raddatz@tools400.de')
000102190131      /eof
000103190131      /endif
000104190131     D DSPLIBSIZ_VERSION...
000105190131     D                 C                   '1.0.1'
000106190131     D DSPLIBSIZ_DATE...
000107190131     D                 C                   '31.01.2019'
