**free
/if not defined(COPYRIGHT_DSPEC)
ctl-opt copyright('V1.1.0 - 06.06.2026 - mailto: thomas.raddatz@tools400.de');
/eof
/endif
dcl-c DSPLIBSIZ_VERSION '1.1.0';
dcl-c DSPLIBSIZ_DATE '06.06.2026';
