      /if not defined(COPYRIGHT_DSPEC)
     h copyright('V1.0.1 - 31.01.2019 - mailto: thomas.raddatz@tools400.de')
      /eof
      /endif
     D DSPLIBSIZ_VERSION...
     D                 C                   '1.0.1'
     D DSPLIBSIZ_DATE...
     D                 C                   '31.01.2019'
