000100000000      /if not defined(errCode_t )
000200000000      /define errCode_t
000300000000      *===============================================================*
000400000000      *  API error code                                               *
000500000000      *===============================================================*
000600000000     d errCode_t       ds                  qualified           based(pDummy)
000700000000     d  bytPrv                       10i 0
000800000000     d  bytAvl                       10i 0
000900000000     d  excID                         7a
001000000000     d  reserved_1                    1a
001100000000     d  excDta                      256a
001200000000      *
001300000000      /endif
