000100000000      /if not defined(qObj_t    )
000200000000      /define qObj_t
000300000000      * ============================================================= *
000400000000      *   Qualified object name                                       *
000500000000      *===============================================================*
000600000000      *
000700000000     d qObj_t          ds                  qualified           based(pDummy)
000800000000     d  name                         10a
000900000000     d  lib                          10a
001000000000      *
001100000000      /endif
